Repository: heholek/gsuite
Catalog: umc/js/*.po
Languages: de

source: <a href="https://admin.google.com/ManageOauthClients" target="_blank">Click here to access the Admin console</a> to <i>Manage API client access</i>.
de: Um den <i>API Client-Zugang</i> per Admin Console zu verwalten klicken Sie <a href="https://admin.google.com/ManageOauthClients" target="_blank">hier</a>.

source: <b>Warning!</b> The configuration has already been done. If you continue, the current connection settings will be replaced.
de: <b>Warnung!</b> Die Konfiguration wurde bereit durchgeführt. Die aktuellen Verbindungseinstellungen werden ersetzt wenn fortgefahren wird.

source: Activate the checkbox <i>Setup SSO with third party identity provider</i> in the security settings.
de: Aktivieren Sie die Checkbox <i>Einmalanmeldung (SSO) mit Identität durch Drittanbieter einrichten</i> in den Sicherheitseinstellungen.

source: After setting these addresses, click on <i>Save</i>.
de: Nach dem Setzen dieser Adressen, klicken Sie auf "Speichern".

source: An error occurred
de: Ein Fehler ist aufgetreten

source: An error occurred while testing the connection to Google Apps for Work. Please run the wizard again.
de: Ein Fehler trat während dem Verbindungstest mit Google Apps for Work auf. Bitte starten Sie den Einrichtungsassistent erneut.

source: As last step the following values needs to be inserted into the input fields as can be seen in the screenshot below:
de: Als letzen Schritt müssen die folgenden Werte in die Eingabefelder wie im untenstehenden Screenshot zu sehen eingefügt werden:

source: Authorize connection between Google and UCS
de: Verbindung zwischen Google und UCS autorisieren.

source: Change password URL
de: URL Passwortänderung

source: Click on <i>Authorize</i> and continue this wizard by clicking on <i>Next</i>.
de: Klicken Sie auf <i>Authorisieren</i> und fahren sie im Einrichtungsassistenten durch klicken auf <i>Weiter</i> fort.

source: Click on <i>Create credentials</i> and select <i>Service account key</i>.
de: Klicken Sie auf <i>Anmeldedaten erstellen</i> und wählen <i>Dienstkontoschlüssel</i>.

source: Click on <i>Next</i> to complete the setup.
de: Klicken Sie auf <i>Weiter</i> um die Konfiguration zu abzuschließen.

source: Click on the button below and select the just downloaded JSON key file. This will upload the credentials key file to UCS.
de: Klicken Sie auf den unteren Button und wählen Sie die gerade heruntergeladene JSON Schlüsseldatei aus. Dadurch werden die Zugangsdaten zu UCS hochgeladen.

source: Congratulations, the connection between UCS and Google Apps for Work has been established.
de: Gratulation, die Verbindung zwischen UCS und Google Apps for Work wurde hergestellt.

source: Continue by clicking on <i>Next</i>.
de: Fahren Sie durch einen Klick auf <i>Weiter</i> fort.

source: Continue when Google has finished creating the project by clicking on <i>Next</i>.
de: Fahren Sie durch klicken auf <i>Weiter</i> fort, wenn Google das Projekt fertiggestellt hat.

source: Copy and paste the information below into the corresponding fields (like seen in the screenshot below).
de: Kopieren und fügen Sie die unten stehenden Informationen in die zugehörigen Felder ein (wie im untenstehenden Screenshot zu sehen).

source: Create a new project
de: Neues Projekt erstellen

source: Create a new project by using the drop down menu in the top navgation bar.
de: Erstellen Sie ein neues Projekt durch Benutzung des Drop-Down-Menü in der oberen Navigationsleiste.

source: Create an encryption key to securly authenticate the UCS server to the Google directory.
de: Erstellen Sie einen Schlüssel, um UCS sicher mit dem Google Verzeichnis zu authentifizieren.

source: Create service account key
de: Dienstkontenschlüssel erstellen

source: Download the {certificate_link}.
de: Laden Sie das {certificate_link} herunter.

source: E-mail address
de: E-mail Adresse

source: Enable <i>Google Apps Domain-wide Delegation</i> and enter a <i>Product name for the consent screen</i> and click on <i>Save</i>.
de: Aktivieren Sie <i>Domain-weite Google-Apps-Delegation</i> und geben Sie einen <i>Produktname für den Zustimmungsbildschirm</i> und bestätigen Sie mit <i>Speichern</i>.

source: Enable Google Apps domain wide delegation
de: Domain-weite Google-Apps-Delegation aktivieren

source: Enable it. This may take a minute.
de: Aktivieren Sie es. Die kann einen Moment dauern.

source: Enable the <i>Admin SDK API</i>
de: <i>Admin SDK API</i> aktivieren

source: Enter the domain that was verified during the configuration of the Google Apps for Work account.
de: Geben Sie die bei der Einrichtung des Google Apps for Work Kontos verifizierte Domäne ein.

source: Enter the e-mail address into the input field below.
de: Fügen Sie die E-Mail-Adresse in das untenstehende Eingabefeld ein.

source: Fine grained access permissions for the service account must be configured in the Admin console.
de: Feingranulare Zugangsberechtigungen für das Dienstkonto müssen in der Admin-Konsole konfiguriert werden.

source: Finish
de: Fertigstellen

source: For the UCS user account for which Google Apps for Work is enabled, an account in the Google Apps for Work directory is created and selected account attributes get synchronized from UCS to the Google directory.
de: Für die UCS-Benutzerkonton, bei denen Google Apps for Work aktiviert wurde, werden entsprechende Konten im Google Apps for Work Benutzerverzeichnis angelegt und ausgewählte Kontoattribute zu diesen synchronisiert.

source: Give the project a name, for example "UCS sync".
de: Geben Sie dem Projekt einen Namen, z.B: "UCS sync".

source: Google Apps for Work configuration
de: Google Apps for Work Konfiguration

source: Google Apps for Work setup complete
de: Google Apps for Work Einrichtung abgeschlossen

source: Google Apps for Work setup wizard
de: Google Apps for Work Einrichtungsassistent

source: Help
de: Hilfe

source: In the new window choose <i>New service account</i> from the drop down menu. Enter a name for the service account (e.g. <i>UCS sync</i>) and select <i>JSON</i> as the key type. The <i>Service account ID</i> will be generated automatically and can be kept like this.
de: Im neuen Fenster wählen Sie <i>Neues Dienstkonto</i> aus der Drop-Down-Liste. Geben Sie einen Namen für das Dienstkonto ein (z.B. <i>UCS sync</i>) und wählen Sie <i>JSON</i> als Schlüsseltyp aus. Die <i>Dienstkonten-ID</i> wird automatisch erstellt und kann so beibehalten werden.

source: Login to the <a href="https://console.developers.google.com/" target="_blank">Google Developers Console</a>.
de: Melden Sie sich an der <a href="https://console.developers.google.com/" target="_blank">Google Developers Console</a> an.

source: Make sure you are in the <i>API Manager</i>.
de: Stellen Sie sicher, dass Sie sich im <i>API Manager</i> befinden.

source: Navigate to <i>Credentials</i>.
de: Navigieren Sie zu <i>Zugangsdaten</i>.

source: On the <i>Credentials</i> page in the Google Developers Console, click in the very right on <i>Manage service accounts</i>.
de: Auf der <i>Zugangsdaten</i>-Seite in der Google Developers Console klicken Sie ganz rechts auf <i>Dienstkonten verwalten</i>.

source: One or More API Scopes
de: Ein oder mehrere API-Bereiche

source: Open the <a href="https://admin.google.com/AdminHome?fral=1#SecuritySettings:flyout=sso" target="_blank">security settings in the Admin Console</a> to configure the single sign-on settings.
de: Öffnen Sie die <a href="https://admin.google.com/AdminHome?fral=1#SecuritySettings:flyout=sso" target="_blank">Sicherheitseinstellungen in der Admin Konsole</a>, um die Single Sign-on Einstellungen zu konfigurieren.

source: Open the <i>Admin SDK</i> page in the <i>Google Apps APIs</i> section.
de: Öffnen Sie die <i>Admin SDK</i> Seite in der <i>Google Apps APIs</i> Sektion.

source: Please follow the steps to create a new project in the <i>Google Developers Console</i>.
de: Bitte folgen Sie den Schritten, um ein neues Projekt in der <i>Google Developers Console</i> zu erstellen.

source: Sign-in page URL
de: Anmeldeseiten-URL

source: Sign-out page URL
de: URL der Abmeldeseite

source: Single Sign-On setup
de: Single Sign-On Konfiguration

source: Synchronized users can log into Google Apps for Work by using the link on the <a href="/ucs-overview#services" target="_blank">UCS overview page</a>.
de: Synchronisierte Benutzer können sich bei Google Apps for Work anmelden, indem sie den Link auf der <a href="/ucs-overview#services" target="_blank">UCS Übersichtsseite</a> nutzen.

source: The <i>Admin SDK API</i> will be used to create user accounts and groups in Googles directory.
de: Die <i>Admin SDK API</i> wird benutzt, um Benutzerkonten und Gruppen im Google Verzeichnis zu erstellen.

source: The UCS SAML Identity Provider needs to be configured in the security settings.
de: Der UCS SAML Identity Provider muss in den Sicherheitseinstellungen konfiguriert werden.

source: The configuration of synchronized attributes can be done via Univention Config Registry.
de: Die zu synchronisierenden Attribute können per Univention Config Registry eingestellt werden.

source: The setup wizard now needs the e-mail address of the administrator user you used to login to the Google Developers Console. The e-mail address can be displayed by clicking on the profile button in the top right corner.
de: Der Einrichtungsassistent benötigt nun die E-Mail Adresse des Administrator Benutzers, die Sie für die Anmeldung an die Google Developers Console benutzt haben. Die E-Mail Adresse kann durch klicken auf den Profil-Button in der oberen rechten Ecke angezeigt werden.

source: The wizard will guide you through the process of setting up a secure connection to the directory in Google Apps for Work. Thereby UCS is able to automatically provision accounts in Google Apps for Work.
de: Der Assistent wird Sie durch den Prozess begleiten, eine sichere Verbindung zum Verzeichnis in Google Apps for Work herzustellen. Damit ist es UCS möglich, automatisch Konten bei Google Apps for Work einzurichten.

source: Then continue by clicking on <i>Next</i>.
de: Danach fahren sie durch klicken auf <i>Weiter</i> fort.

source: Then edit the service account you just created by clicking the three dots on the right (please maximize your window if the three dots aren't shown).
de: Dann bearbeiten Sie das gerade erstellte Dienstkonto durch klicken auf die drei Punkte an der rechten Seite (bitte maximieren Sie Ihr Browser-Fenster falls die drei Punkte nicht angezeigt werden).

source: Then upload the certificate as <i>Verification certificate</i> by clicking on <i>CHOOSE FILE</i> and <i>UPLOAD</i>.
de: Danach laden Sie das Zertifikat als <i>Bestätigungszertifikat</i> durch klicken auf <i>DATEI AUSWÄHLEN</i> und <i>HOCHLADEN</i> hoch.

source: This will offer you to download the key file after clicking on <i>Create</i>. Save this key file on your hard disk in a secure location.
de: Nach dem Klicken auf <i>Erstellen</i> wird die Schlüsseldatei zum herunterladen angeboten. Speichern Sie die Schlüsseldatei an einem sicheren Ort auf Ihrer Festplatte.

source: This wizard helps you to configure the connection between UCS and Google Apps for Work.
de: Dieser Einrichtungsassistent hilft Ihnen die Verbindung zwischen UCS und Google Apps for Work zu konfigurieren.

source: To allow UCS to automatically create, modify and delete Google user accounts, "Domain-wide Delegation" must be enabled for the service account.
de: Um UCS zu erlauben, automatisch Google Benutzerkonten zu erstellen, zu bearbeiten und zu löschen, muss die "Domain-weite Delegation" für dieses Dienstkonto aktiviert werden.

source: To allow UCS to synchronize selected user accounts to the Google directory, a new project must be created in the Google Developers Console.
de: Um UCS zu erlauben, ausgewählte Benutzerkonten ins Google Verzeichnis zu synchronisieren muss ein neues Projekt in der Google Developers Console erstellt werden.

source: To authorize the connection between this App and Google Apps for Work please follow these instructions:
de: Um die Verbindung zwischen dieser App und Google Apps for Work zu autorisieren folgen Sie bitte den Anweisungen:

source: To finalize the setup, single sign-on has to be configured for the Google Apps for Work domain.
de: Um die Konfiguration abzuschließen muss Single Sing-on für die Google Apps for Work Domäne eingerichtet werden.

source: To use this app you need a valid Google Apps for Work admin acccount and a domain for which the ownership has been <a href="https://support.google.com/a/topic/9196" target="_blank">verified by Google</a>.
de: Um diese App zu benutzen, benötigen Sie ein gültiges Google Apps for Work Administratorkonto und eine Domäne deren Besitz gegenüber <a href="https://support.google.com/a/topic/9196?hl=de" target="_blank">Google verifiziert</a> wurde.

source: UCS Identity Provider certificate
de: UCS Identity Provider Zertifikat

source: UCS will use the encryption key for communicating with the Google directory.
de: UCS wird den Schlüssel benutzen, um mit dem Google Verzeichnis zu kommunizieren.

source: Upload service account key
de: Dienstkontenschlüssel hochladen

source: User accounts may now be enabled for Google Apps for Work access.
de: Benutzerkonten können nun für den Google Apps for Work Zugang aktiviert werden.

source: Users can now single sign on into the Google Apps for Work account.
de: Benutzer können nun Single Sign-On zu Google Apps for Work benutzen.

source: Verified domain name
de: Verifizierter Domänenname

source: Via the Univention Config Registry variables <i>google-apps/attributes/mapping/.*</i> can be configured which LDAP attributes (e.g. given name, surname, etc.) of a user account are sychronized.
de: Über die Univention Config Registry Variablen <i>google-apps/attributes/mapping/.*</i> ist konfigurierbar, welche LDAP-Attribute (z.B. Vorname, Nachname, etc.) eines Benutzerkontos synchronisiert werden.

source: Welcome to the Google Apps for Work configuration
de: Willkommen zur Google Apps for Work Konfiguration

source: Welcome to the Google Apps for Work setup wizard. A few steps are needed to complete the configuration process.
de: Willkommen zum Google Apps for Work Einrichtungsassistent. Es sind einige Schritte notwendig, um den Konfigurationsprozess fertigzustellen.

source: Welcome to the Univention <a href="https://apps.google.com/" target="_blank">Google Apps for Work</a> configuration wizard.
de: Willkommen zum Univention <a href="https://apps.google.com/" target="_blank">Google Apps for Work</a> Konfigurationsassistenten.

source: When Google has finished enabling the <i>Admin SDK API</i>, ignore the displayed notification and continue by clicking on <i>Next</i>.
de: Wenn Google die Aktivierung der <i>Admin SDK API</i> abgeschlossen hat, ignorieren Sie den angezeigten Hinweistext und fahren Sie durch klicken auf <i>Weiter</i> fort.

source: You can now enable the Google Apps for Work synchronization for users on the <i>Google Apps</i> tab in the %s.
de: Sie können nun die Google Apps for Work Synchronisation für Benutzer im <i>Google Apps</i>-Tab im %s aktivieren.

source: You may add or remove attributes by using the %s.
de: Sie können mithilfe des %s Attribute löschen oder hinzufügen.

source: You need a <a href="%(domain)s" target="_blank">verified domain</a> and access to the <a href="%(dev)s" target="_blank">Google Developer Console</a> as well as to the <a href="%(admin)s" target="_blank">Google Admin Console</a> with a Google Apps for Work administrator account.
de: Sie benötigen eine <a href="%(domain)s" target="_blank">verifizierte Domäne</a> und Zugang mit einem Google Apps for Work Administratorkonto zur <a href="%(dev)s" target="_blank">Google Developer Console</a> und zur <a href="%(admin)s" target="_blank">Google Admin Console</a>.

source: admin_console_create_project_EN.png
de: admin_console_create_project_DE.png

source: admin_email.png
de: admin_email_de.png

source: api_manager_nav.png
de: api_manager_nav_de.png

source: authorize_api_access_EN.png
de: authorize_api_access_DE.png

source: create_service_account_key.png
de: create_service_account_key_de.png

source: credentials_nav.png
de: credentials_nav_de.png

source: edit_service_account.png
de: edit_service_account_de.png

source: enable_delegation_and_prod_name.png
de: enable_delegation_and_prod_name_de.png

source: google-sso-login.png
de: google-sso-login_de.png

source: google_admin_sdk_enable.png
de: google_admin_sdk_enable_de.png

source: google_sso_EN.png
de: google_sso_DE.png

source: google_user.png
de: google_user_de.png

source: https://support.google.com/a/topic/9196
de: https://support.google.com/a/topic/9196?hl=de

source: new_project.png
de: new_project_de.png

source: new_service_account.png
de: new_service_account_de.png
